In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("D:\Youtube\pandas\HousePrices.csv")

In [3]:
df

      area     price
0   2600.0  550000.0
1   3000.0  565000.0
2   3200.0  610000.0
3   3600.0  680000.0
4   4000.0  725000.0
5   5000.0  827000.0
6   1500.0  320000.0
7  12232.0       NaN
8      NaN     123.0

In [4]:
df.head()

     area     price
0  2600.0  550000.0
1  3000.0  565000.0
2  3200.0  610000.0
3  3600.0  680000.0
4  4000.0  725000.0

In [5]:
df.head(3)

     area     price
0  2600.0  550000.0
1  3000.0  565000.0
2  3200.0  610000.0

In [6]:
df.describe()

               area          price
count      8.000000       8.000000
mean    4391.500000  534640.375000
std     3328.441205  262258.425028
min     1500.000000     123.000000
25%     2900.000000  492500.000000
50%     3400.000000  587500.000000
75%     4250.000000  691250.000000
max    12232.000000  827000.000000

In [7]:
df.area

0     2600.0
1     3000.0
2     3200.0
3     3600.0
4     4000.0
5     5000.0
6     1500.0
7    12232.0
8        NaN
Name: area, dtype: float64

In [8]:
df['area']

0     2600.0
1     3000.0
2     3200.0
3     3600.0
4     4000.0
5     5000.0
6     1500.0
7    12232.0
8        NaN
Name: area, dtype: float64

In [9]:
df['area'].max()

12232.0

In [10]:
df['price'].min()

123.0

In [11]:
df['area'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
Name: area, dtype: bool

In [13]:
df['price'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
Name: price, dtype: bool

In [14]:
df.tail()

      area     price
4   4000.0  725000.0
5   5000.0  827000.0
6   1500.0  320000.0
7  12232.0       NaN
8      NaN     123.0

In [15]:
df[2:5]

     area     price
2  3200.0  610000.0
3  3600.0  680000.0
4  4000.0  725000.0

In [16]:
df['area'][2:5]

2    3200.0
3    3600.0
4    4000.0
Name: area, dtype: float64

In [17]:
df[df['area']>3200]

      area     price
3   3600.0  680000.0
4   4000.0  725000.0
5   5000.0  827000.0
7  12232.0       NaN

In [18]:
df[df.area==df.area.max()]

      area  price
7  12232.0    NaN